Griffin-bb/Bluetooth-Remote-Control-Smart-Door-Opening-System-Based-on-STM32/hardware/LED.c
#include "stm32f10x.h"                  // Device header


uint8_t LED_Luminance = 5;                                               //LED默认亮度100%

/**@define 初始化LED模块函数
  *
  *@brief 用TIM3_CH3输出比较给LED灯输出PWM，从而可调节LED灯亮度
  *@attention LED灯正极接PB0引脚，负极接GND
  */
void LED_Init(void)
{
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;                              //初始化PB0引脚
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB,&GPIO_InitStructure);
	
	TIM_InternalClockConfig(TIM3);
	
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInitStructure.TIM_Period = 100-1;                          //ARR
	TIM_TimeBaseInitStructure.TIM_Prescaler = 18-1;                       //PSC
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM3,&TIM_TimeBaseInitStructure);

	TIM_OCInitTypeDef TIM_OCInitStructure;
	TIM_OCStructInit(&TIM_OCInitStructure);
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_Pulse = 0;                                    //CCR
	TIM_OC3Init(TIM3,&TIM_OCInitStructure);
	
	TIM_Cmd(TIM3,ENABLE);
}

/*可用该函数设置LED灯亮度*/
void LED_SetLuminance(uint16_t Luminance)
{
    LED_Luminance = Luminance;
}

void LED_ON(void)
{
    TIM_SetCompare3(TIM3,LED_Luminance);
}

void LED_OFF(void)
{
    TIM_SetCompare3(TIM3,0);
}
